----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 14, 14]             640
       BatchNorm2d-2           [-1, 64, 14, 14]             128
              ReLU-3           [-1, 64, 14, 14]               0
         ConvBlock-4           [-1, 64, 14, 14]               0
            Conv2d-5             [-1, 64, 7, 7]          36,928
       BatchNorm2d-6             [-1, 64, 7, 7]             128
              ReLU-7             [-1, 64, 7, 7]               0
         ConvBlock-8             [-1, 64, 7, 7]               0
            Conv2d-9             [-1, 64, 4, 4]          36,928
      BatchNorm2d-10             [-1, 64, 4, 4]             128
             ReLU-11             [-1, 64, 4, 4]               0
        ConvBlock-12             [-1, 64, 4, 4]               0
           Conv2d-13             [-1, 64, 2, 2]          36,928
      BatchNorm2d-14             [-1, 64, 2, 2]             128
             ReLU-15             [-1, 64, 2, 2]               0
        ConvBlock-16             [-1, 64, 2, 2]               0
           Linear-17                   [-1, 20]           1,300
      OmniglotCNN-18                   [-1, 20]               0
             MAML-19                   [-1, 20]               0
================================================================
Total params: 113,236
Trainable params: 113,236
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.52
Params size (MB): 0.43
Estimated Total Size (MB): 0.95
----------------------------------------------------------------
