----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1                 [-1, 5, 5]           8,005
              MAML-2                 [-1, 5, 5]           8,005
================================================================
Total params: 16,010
Trainable params: 16,010
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.03
Forward/backward pass size (MB): 0.00
Params size (MB): 0.06
Estimated Total Size (MB): 0.09
----------------------------------------------------------------
