----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1               [-1, 1, 100]           1,000
              ReLU-2               [-1, 1, 100]               0
            Linear-3               [-1, 1, 100]          10,100
              ReLU-4               [-1, 1, 100]               0
            Linear-5                 [-1, 1, 4]             404
  DiagNormalPolicy-6                 [-1, 1, 4]               0
================================================================
Total params: 11,504
Trainable params: 11,504
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.00
Estimated Total Size (MB): 0.00
----------------------------------------------------------------
