----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 84, 84]             896
       BatchNorm2d-2           [-1, 32, 84, 84]              64
              ReLU-3           [-1, 32, 84, 84]               0
         MaxPool2d-4           [-1, 32, 42, 42]               0
         ConvBlock-5           [-1, 32, 42, 42]               0
            Conv2d-6           [-1, 32, 42, 42]           9,248
       BatchNorm2d-7           [-1, 32, 42, 42]              64
              ReLU-8           [-1, 32, 42, 42]               0
         MaxPool2d-9           [-1, 32, 21, 21]               0
        ConvBlock-10           [-1, 32, 21, 21]               0
           Conv2d-11           [-1, 32, 21, 21]           9,248
      BatchNorm2d-12           [-1, 32, 21, 21]              64
             ReLU-13           [-1, 32, 21, 21]               0
        MaxPool2d-14           [-1, 32, 10, 10]               0
        ConvBlock-15           [-1, 32, 10, 10]               0
           Conv2d-16           [-1, 32, 10, 10]           9,248
      BatchNorm2d-17           [-1, 32, 10, 10]              64
             ReLU-18           [-1, 32, 10, 10]               0
        MaxPool2d-19             [-1, 32, 5, 5]               0
        ConvBlock-20             [-1, 32, 5, 5]               0
           Linear-21                    [-1, 5]           4,005
  MiniImagenetCNN-22                    [-1, 5]               0
             MAML-23                    [-1, 5]               0
================================================================
Total params: 32,901
Trainable params: 32,901
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.08
Forward/backward pass size (MB): 7.99
Params size (MB): 0.13
Estimated Total Size (MB): 8.20
----------------------------------------------------------------
