----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 84, 84]           1,792
       BatchNorm2d-2           [-1, 64, 84, 84]             128
              ReLU-3           [-1, 64, 84, 84]               0
         MaxPool2d-4           [-1, 64, 42, 42]               0
         ConvBlock-5           [-1, 64, 42, 42]               0
            Conv2d-6           [-1, 64, 42, 42]          36,928
       BatchNorm2d-7           [-1, 64, 42, 42]             128
              ReLU-8           [-1, 64, 42, 42]               0
         MaxPool2d-9           [-1, 64, 21, 21]               0
        ConvBlock-10           [-1, 64, 21, 21]               0
           Conv2d-11           [-1, 64, 21, 21]          36,928
      BatchNorm2d-12           [-1, 64, 21, 21]             128
             ReLU-13           [-1, 64, 21, 21]               0
        MaxPool2d-14           [-1, 64, 10, 10]               0
        ConvBlock-15           [-1, 64, 10, 10]               0
           Conv2d-16           [-1, 64, 10, 10]          36,928
      BatchNorm2d-17           [-1, 64, 10, 10]             128
             ReLU-18           [-1, 64, 10, 10]               0
        MaxPool2d-19             [-1, 64, 5, 5]               0
        ConvBlock-20             [-1, 64, 5, 5]               0
           Lambda-21                 [-1, 1600]               0
================================================================
Total params: 113,088
Trainable params: 113,088
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.08
Forward/backward pass size (MB): 16.00
Params size (MB): 0.43
Estimated Total Size (MB): 16.51
----------------------------------------------------------------
