------------------------------------------------------------------------------------------
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Sequential: 1-1                        [-1, 1, 4]                --
|    └─Linear: 2-1                       [-1, 1, 100]              1,000
|    └─ReLU: 2-2                         [-1, 1, 100]              --
|    └─Linear: 2-3                       [-1, 1, 100]              10,100
|    └─ReLU: 2-4                         [-1, 1, 100]              --
|    └─Linear: 2-5                       [-1, 1, 4]                404
==========================================================================================
Total params: 11,504
Trainable params: 11,504
Non-trainable params: 0
Total mult-adds (M): 0.02
------------------------------------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.04
Estimated Total Size (MB): 0.05
------------------------------------------------------------------------------------------